app/controllers/movies_controller.rb

    def index

      @all_ratings = Movie.ratings


      if params[:sort]
        @sort = params[:sort]
      else
        @sort = session[:sort]
      end

      # session[:sort] = params[:sort]

      @ratings =  params[:ratings] || session[:ratings] || @ratings || Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R')  ORDER BY release_date

    def create
      @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Mission Impossible"], ["rating", "PG-13"], ["release_date", "2022-02-28 00:00:00.000000"], ["created_at", "2022-02-28 05:10:20.693069"], ["updated_at", "2022-02-28 05:10:20.693069"]]